'|'''''''''''''''''''''''''''''''''''''''''''''''''''''''
'|初期設定
option explicit
on error resume next
err.clear
dim test, enzansies, i, draw
draw = ""
'''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'|'''''''''''''''''''''''''''''''''''''''''''''''''''''''
'|演算子一覧
enzansies = array(_
"+ [加算]",_
"- [減算]",_
"* [乗算]",_
"/ [除算]",_
"^ [指数演算]",_
"\ [整数演算]",_
"Mod [剰余演算]",_
"& [文字列連結]",_
"= [等しい]",_
"<> [等しくない]",_
"< [より小さい]",_
"> [より大きい]",_
"Is [オブジェクト等価比較]",_
"Not [論理否定]",_
"And [論理積]",_
"Or [論理和]" &vbCrLf,_
"vbCrLf [改行]",_
"vbNewLine [改行]",_
"chr(10) [改行(厳密には、LF)]",_
"chr(13) [改行(厳密には、CR)]",_
"chr(32) [タブ]",_
"chr(9) [スペース]"_
)
for each i in enzansies
 draw = draw &vbcrlf &i
next
msgbox draw
'''''''''''''''''''''''''''''''''''''''''''''''''''''''''
'|'''''''''''''''''''''''''''''''''''''''''''''''''''''''
'|想定外エラー処理
if err.number <> 0 then
 msgbox "Error:" &err.number &chr(10) &err.description
end if
on error goto 0
'''''''''''''''''''''''''''''''''''''''''''''''''''''''''
